app/controllers/admins_controller.rb

  def index
    @admins = Admin.all
---
SELECT * FROM `admins`