app/controllers/comments_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
INSERT INTO `comments` (`created_at`, `body`, `updated_at`, `post_id`) VALUES('2009-11-18 02:54:50', 'Wow sounds like they are in a tough spot.', '2009-11-18 02:54:50', 1)
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!(params[:comment])