app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`) VALUES('2009-11-16 23:52:46', 'The Bentar Project', 'Bentar Development came to Cube2Media for some help with their marketing woes. They have found themselves in a tough spot, by that I mean the same spot that many builders and developers in Las Vegas found themselves in when the Mortage Banking System collapsed. Bentar Development was used to a steady diet of about $10-$12 million in annual sales handed to them through the relationships of the owner and the reputation of the company. Bentar has now found themselves in a market of professional tenant improvements, design build projects, and remodels. New construction has almost come to a halt, as most of the properties built in the last 5 years have found themselves either vacant or boarded up. It is time for a company to use smart marketing and Cube2Media was the choice they made.', '2009-11-16 23:52:46')